Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: The next two fields are values extracted from that commit—the author name and the authored date of that commit — so you can easily see who modified that line and when.
es: Los dos siguientes campos son sendos valores extraidos de dicha confirmación de cambios --el nombre del autor y la fecha--, mostrando quien y cuándo modifico esa línea.

source: It’s pretty easy on your part.
es: Es realmente sencillo.

source: To create a commit object, you call `commit-tree` and specify a single tree SHA-1 and which commit objects, if any, directly preceded it.
es: Para crearlos, tan solo has de llamar al comando `commit-tree`, indicando uno de los árboles SHA-1 y los objetos de confirmación de cambios que lo preceden (si es que lo precede alguno).

source: The `pre-rebase` hook runs before you rebase anything and can halt the process by exiting non-zero.
es: El punto 'pre-rebase' se activa antes de cualquier reorganización y puede abortarla si retorna con un codigo de salida distinto de cero.

source: If we have a repository with work in two branches named `ruby_client` and `php_client` that looks like Figure 5-19 and merge `ruby_client` first and then `php_client` next, then your history will end up looking like Figure 5-20.
es: Si, tal y como se muestra en la Figura 5-19, tenemos un repositorio con trabajos en dos ramas, denominadas 'ruby client' y 'php client'; y fusionamos primero la rama 'ruby client' y luego la 'php client', obtendremos un historial similar al de la Figura 5-20.

source: You can see from the size value that the big object is still in your loose objects, so it’s not gone; but it won’t be transferred on a push or subsequent clone, which is what is important.
es: Por el valor de "size", puedes ver que el objeto enorme sigue estando entre tus objetos sueltos; es decir, no hemos acabado completamente con él. Pero lo importante es que ya no será considerado al transferir o clonar el proyecto.

source: If you do sign your tags, you may have the problem of distributing the public PGP key used to sign your tags.
es: Si firmas tus etiquetas, puedes tener un problema a la hora de distribuir la clave PGP pública utilizada en la firma.

source: You’ll add a new section called `mobile` where you’ll list the developers on your mobile team and projects that those developers need access to.
es: Por ejemplo, puedes añadir una nueva sección denominada 'mobile', donde poner la lista de los desarrolladores en tu equipo movil y los proyectos donde estos vayan a trabajar.

source: Both of those changes are isolated in separate branches: you can switch back and forth between the branches and merge them together when you’re ready.
es: Los cambios realizados en ambas sesiones de trabajo están aislados en ramas independientes: puedes saltar libremente de una a otra según estimes oportuno.

source: After you’ve resolved each of these sections in each conflicted file, run `git add` on each file to mark it as resolved.
es: Tras resolver todos los bloques conflictivos, has de lanzar comandos 'git add' para marcar cada archivo modificado.

source: To stage the TODO and index.html files, you can type the numbers:
es: Para añadir los archivos TODO e index.html, se teclearian los números:

source: The update file runs once per branch being pushed and takes the reference being pushed to, the old revision where that branch was, and the new revision being pushed.
es: El script 'update' se lanza una vez por cada rama que se envia (push) al servidor; y recibe la referencia de la rama a la que se envia, la antigua revisión en que estaba la rama y la nueva revisión que se está enviando.

source: The `post-receive` hook runs after the entire process is completed and can be used to update other services or notify users.
es: El punto de enganche 'post-receive' se activa cuando termina todo el proceso, y se puede utilizar para actualizar otros servicios o para enviar notificaciones a otros usuarios.

source: Recently, I was refactoring a file named `GITServerHandler.m` into multiple files, one of which was `GITPackUpload.m`.
es: Por ejemplo, si se estaba refactorizando un archivo llamado `GITServerHandler.m`, para trocearlo en múltiples archivos, siendo uno de estos `GITPackUpload.m`.

source: For instance, suppose you create a template file at `$HOME/.gitmessage.txt` that looks like this:
es: Por ejemplo, imagina que creas una plantilla en '$HOME/.gitmessage.txt'; con un contenido tal como:

source: ### Long-Running Branches ###
es: ### Ramas de largo recorrido ###

source: More detailed explanatory text, if necessary.
es: Seguido de un texto más detallado, si es necesario.

source: If you’re on a tracking branch and type git push, Git automatically knows which server and branch to push to.
es: Si estás en una rama de seguimiento y tecleas el comando 'git push', Git sabe automáticamente a qué servidor y a qué rama ha de llevar los contenidos.

source: ## Git Attributes ##
es: ## Atributos de Git ##

source: One very useful option is to tell Git to not try to merge specific files when they have conflicts, but rather to use your side of the merge over someone else’s.
es: Una opción muy util es la que nos permite indicar a Git que no intente fusionar ciertos archivos concretos cuando tengan conflictos, manteniendo en su lugar tus archivos sobre los de cualquier otro.

source: Fast-forwarding your master branch to include the client branch changes.
es: Avance rápido de tu rama 'master', para incluir los cambios de la rama 'client'.

source: Because the server will tell you that you can’t push a non-fast-forward anyway, and the hook prevents forced pushes, the only accidental thing you can try to catch is rebasing commits that have already been pushed.
es: De todas formas, el único aspecto accidental que puede interesante capturar son los intentos de reorganizar confirmaciones de cambios ya enviadas. El servidor te avisará de que no puedes enviar ningún no-avance-rapido, y el enganche te impedirá cualquier envio forzado

source: Using attributes, you can do things like specify separate merge strategies for individual files or directories in your project, tell Git how to diff non-text files, or have Git filter content before you check it into or out of Git.
es: Por medio de los atributos, puedes hacer cosas tales como indicar diferentes estrategias de fusión para archivos o carpetas concretas de tu proyecto, decirle a Git cómo comparar archivos no textuales, o indicar a Git que filtre ciertos contenidos antes de guardarlos o de extraerlos del repositorio Git.

source: If you update a reference, Git doesn’t edit this file but instead writes a new file to `refs/heads`.
es: Si actualizas alguna de las referencias, Git no modificará este archivo. Sino que, en cambio, escribirá uno nuevo en `refs/heads`.

source: You can set up your new repository by copying your bare repository over:
es: Puedes colocar tu nuevo repositorio simplemente copiandolo:

source: To really understand the way Git does branching, we need to take a step back and examine how Git stores its data.
es: Para entender realmente cómo ramifica Git, previamente hemos de examinar la forma en que almacena sus datos.

source: If you received the patch from someone who generated it with the `git diff` or a Unix `diff` command, you can apply it with the `git apply` command.
es: Si recibes un parche de alguien que lo ha generado con el comando 'git diff' o con un comando 'diff' de Unix, puedes incorporalo con el comando 'git apply'.

source: For example, you can do some simple version control on a file.
es: Por ejemplo, puedes realizar un control simple de versiones sobre un archivo.

source: For instance, if Jessica wants to send John a pull request, and she’s done two commits on the topic branch she just pushed up, she can run this:
es: Por ejemplo, si Jessica quiere enviar a John una solicitud de recuperación, y ha realizado dos confirmaciones de cambios sobre la rama puntual que desea enviar, lanzará los siguientes comandos:

source: If you just specify the path, Git tries to use hardlinks or directly copy the files it needs.
es: Si escribes simplemente el camino, Git intentará usar enlaces rígidos (hardlinks) o copiar directamente los archivos que necesita.

source: You use `git format-patch` to generate the mbox-formatted files that you can e-mail to the list — it turns each commit into an e-mail message with the first line of the commit message as the subject and the rest of the message plus the patch that the commit introduces as the body.
es: Utilizarás el comando `git format-patch` para generar archivos formateados para poder ser enviados por correo electrónico. Este comando convierte cada confirmación de cambios (commit) en un mensaje de correo; con la primera línea del mensaje de confirmación puesto como asunto, y el resto del mensaje mas el parche como cuerpo.

source: Git normally creates a tree by taking the state of your staging area or index and writing a tree object from it.
es: Habitualmente Git suele crear un árbol a partir del estado de tu área de preparación (staging area) o índice, escribiendo un objeto árbol con él.

source: Notice that you have to tell the command where to find your Git repositories with the `GITWEB_PROJECTROOT` variable.
es: Fijate que es necesario indicar la ubicación donde se encuentran los repositorios Git, utilizando la variable 'GITWEB_PROJECTROOT'.

source: To enforce this, you’ll write those rules to a file named `acl` that lives in your bare Git repository on the server.
es: Para implementar esto, has de escribir esas reglas de acceso en un archivo denominado 'acl' ubicado en tu repositorio git básico en el servidor.

source: Git automatically expands the `serverfix` branchname out to `refs/heads/serverfix:refs/heads/serverfix`, which means, “Take my serverfix local branch and push it to update the remote’s serverfix branch.” We’ll go over the `refs/heads/` part in detail in Chapter 9, but you can generally leave it off.
es: Git expande automáticamente el nombre de rama 'serverfix' a 'refs/heads/serverfix:refs/heads/serverfix', que significa: "coge mi rama local 'serverfix' y actualiza con ella la rama 'serverfix' del remoto". Volveremos más tarde sobre el tema de 'refs/heads/', viendolo en detalle en el capítulo 9; aunque puedes ignorarlo por ahora.

source: These features help encourage developers to create and use branches often.
es: Animando así a los desarrolladores a utilizar ramificaciones frecuentemente.

source: There is another history-rewriting option that you can use if you need to rewrite a larger number of commits in some scriptable way — for instance, changing your e-mail address globally or removing a file from every commit.
es: Existe una opción de reescritura del historial que se puede utilizar si se necesita reescribir un gran número de confirmaciones de cambio de forma mas o menos automatizada. Por ejemplo, para cambiar una dirección de correo electrónico globalmente, o para quitar un archivo de todas y cada una de las confirmaciones de cambios en una determinada rama.

source: Jessica’s history after merging John’s changes.
es: El historial de Jessica tras fusionar los cambios de John.

source: No commit was completed in that instance.
es: Y la confirmación no se llevará a cabo.

source: We assume that if you have a server with which to do this, you already have an SSH server installed, and that’s how you’re accessing the server.
es: Suponiendo que ya tengas el servidor, que el servicio SSH esté instalado y que sea esa la vía de acceso que tú estés utilizando para acceder a él.

source: Or, if you want to also switch to it immediately, you can use the `checkout -b` option:
es: O, si deseas crearla y saltar inmediatamente a ella, puedes también utilizar la opción '-b' del comando 'checkout':

source: It often happens that while working on one project, you need to use another project from within it.
es: Suele ser frecuente encontrarse con la necesidad de utilizar otro proyecto desde dentro del que se está trabajando.

source: If you place your data on a hosted server, it’s easy to set up and maintain; however, you have to be able to keep your code on someone else’s servers, and some organizations don’t allow that.
es: Si ubicas tus datos en un servidor albergado, será sencillo configurarlo y mantenerlo. Pero tienes que estar dispuesto a mantener tu código en servidores de terceros, cosa que no suele estar permitido en algunas organizaciones.

source: Git object data for multiple commits.
es: Datos en el repositorio tras una serie de confirmaciones.

source: You must run two commands: `git submodule init` to initialize your local configuration file, and `git submodule update` to fetch all the data from that project and check out the appropriate commit listed in your superproject:
es: Son necesarios otros dos comandos: `git submodule init` para inicializar el archivo de configuración local, y `git submodule update` para recuperar (fetch) todos los datos del proyecto y extraer (checkout) la confirmación de cambios adecuada desde el proyecto padre:

source: #### Applying a Patch with apply ####
es: #### Incorporando un parche con apply ####

source: Notice that the `lib` subdirectory isn’t a blob but a pointer to another tree:
es: Fíjate en que la carpeta `lib` no es un objeto binario, sino un apuntador a otro objeto tipo árbol.

source: This means that if two developers clone from the hub and both make changes, the first developer to push their changes back up can do so with no problems.
es: Esto significa que, si dos desarrolladores clonan desde el punto central, y ambos hacen cambios; tan solo el primero de ellos en enviar sus cambios de vuelta lo podrá hacer limpiamente.

source: Git also provides a couple of tools to help you debug issues in your projects.
es: Git dispone también de un par de herramientas muy útiles para tareas de depuración en los proyectos.

source: Now you get the call that there is an issue with the web site, and you need to fix it immediately.
es: Entonces, recibes una llamada avisandote de otro problema urgente en el sitio web. Problema que has de resolver inmediatamente.

source: ### Changing the Last Commit ###
es: ### Modificar la última confirmación de cambios ###

source: John tries to push his change up, too:
es: John intenta enviar también sus cambios:

source: Let’s go back to the objects database for your test Git repository.
es: Volviendo a los objetos en la base de datos de tu repositorio Git de pruebas.

source: You can do things like check for code style (run lint or something equivalent), check for trailing whitespace (the default hook does exactly that), or check for appropriate documentation on new methods.
es: Puede ser util para realizar tareas tales como revisar el estilo del código (lanzando 'lint' o algo equivalente), revisar los espacios en blanco de relleno (el script de ejemplo hace exactamente eso), o revisar si todos los nuevos métodos llevan la adecuada documentación.

source: To do so, you use `filter-branch`, which you used in Chapter 6:
es: Y, para ello, puedes emplear el comando `filter-branch` que se vió en el capítulo 6.

source: These filters can be set to do all sorts of fun things.
es: Estos filtros pueden utilizarse para realizar todo tipo de acciones útiles.

source: You can get very specific about what you want colored and how; but to turn on all the default terminal coloring, set `color.ui` to true:
es: Puedes ajustar con precisión cada una de las partes a colorear; pero si deseas activar de un golpe todos los colores por defecto, no tienes más que poner a "true" el parámetro 'color.ui'.

source: Adding another server as a remote.
es: Añadiendo otro servidor como remoto.

source: The Git project has well-formatted commit messages — I encourage you to run `git log --no-merges` there to see what a nicely formatted project-commit history looks like.
es: El proyecto Git tiene los mensajes adecuadamente formateados. Te animo a lanzar el comando 'git log --no-merges' en dicho proyecto, para que veas la pinta que tiene un historial de proyecto limpio y claro.

source: Now your project is hosted on GitHub, and you can give the URL to anyone you want to share your project with.
es: Así, tu proyecto estará alojado en GitHub; y podrás dar su URL a cualquiera con quien desees compartirlo.

source: This is interesting, because now your testing branch has moved forward, but your master branch still points to the commit you were on when you ran `git checkout` to switch branches.
es: Observamos algo interesante: la rama 'testing' avanza, mientras que la rama 'master' permanece en la confirmación donde estaba cuando lanzaste el comando 'git checkout' para saltar.

source: If you try to check out that object again at some point, you’ll always get the data of the first object.
es: Al intentar recuperar (check-out) el objeto más tarde, siempre se obtendrán los datos del primer objeto.

source: This is helpful if a branch in your project has diverged or is specialized, but you want to be able to merge changes back in from it, and you want to ignore certain files.
es: Puede ser interesante si una rama de tu proyecto es divergente o esta especializada, pero deseas seguir siendo capaz de fusionar cambios de vuelta desde ella, e ignorar ciertos archivos.

source: It’s possible to make Git push over HTTP as well, although that technique isn’t as widely used and requires you to set up complex WebDAV requirements.
es: Es posible hacer que Git envie (push) a través de HTTP. Pero no se suele usar demasiado, ya que requiere lidiar con los complejos requerimientos de WebDAV.

source: Then, write some new content to the file, and save it again:
es: A continuación, escribe algo más de contenido en el archivo y vuelvelo a guardar:

source: Next, the person who pushed the merged work decides to go back and rebase their work instead; they do a `git push --force` to overwrite the history on the server.
es: A continuación, la persona que habia llevado cambios al servidor central decide retroceder y reorganizar su trabajo; haciendo un 'git push --force' para sobreescribir el registro en el servidor.

source: In this case, you can try to rebase that branch on top of `origin/master`, resolve the conflicts for the maintainer, and then resubmit your changes:
es: En este caso, puedes intentar reorganizar (rebase) tu parche sobre 'origin/master', arreglar los conflictos y volver a enviar tus cambios:

source: If you want to always fetch the master and experiment branches, add two lines:
es: Si, por ejemplo, siempre recuperas las ramas 'master' y 'experiment', puedes poner dos lineas:

source: In this section, you’ll learn about some of the attributes you can set on your paths in your Git project and see a few examples of using this feature in practice.
es: En esta sección, aprenderas acerca de algunos atributos que puedes asignar a ciertos caminos (paths) dentro de tu proyecto Git, viendo algunos ejemplos de cómo utilizar sus funcionalidades de manera práctica.

source: If you rebase commits that have already been pushed publicly, and people may have based work on those commits, then you may be in for some frustrating trouble.
es: Si, por el contrario, reorganizas confirmaciones que alguna vez han sido públicas y otra gente ha basado su trabajo en ellas. Entonces estarás en un aprieto.

source: This section revisits a couple of commands so you can see how you can use them to review exactly what you’ll be introducing if you merge this into your main branch.
es: En esta sección revisaremos un par de comandos, que te ayudarán a ver exactamente los cambios que introducirás si fusionas dicha rama puntual con tu rama principal.

source: You can easily see what commits modified this file:
es: Es sencillo revisar cuales son las confirmaciones de cambios donde interviene ese archivo:

source: Changing your last commit is probably the most common rewriting of history that you’ll do.
es: Modificar la última confirmación de cambios (commit) es probablemente el arreglo realizado con más frecuencia.

source: This means that if you commit at this point, the `master` branch will be moved forward with your new work.
es: Si hacemos una confirmación de cambios (commit), esa será la rama que avance.

source: This is called a _refspec_.
es: Esto es lo que se denomina un _refspec_.

source: It’s also a good idea to use the imperative present tense in these messages.
es: Es también buena idea redactar los mensajes utilizando el imperativo, en tiempo presente.

source: If you run `git status` right after you add the submodule, you see two things:
es: Si se lanza `git status` nada mas añadir el submódulo, se aprecian dos cosas:

source: ### Importing from Subversion ###
es: ### Importación desde Subversion ###

source: This command is sort of a Swiss army knife for inspecting Git objects.
es: Este comando es algo así como una "navaja suiza" para inspeccionar objetos Git.
